;;;; constants.lisp

(in-package #:mnas-dim-value)

(progn 
  (defparameter *g*     9.80665d0               "Ускорение свободного падения, м/с^2")
  (defparameter *Gn*    6.6740831d-11           "Гравитационная постоянная, м^3/кг*с^2")
  (defparameter *C-0*   273.15d0                "Ноль шкалы температур Цельсия, К")
  (defparameter *V-0*   22.41396213d0           "Молекулярный объем идеального газа при нормальных условиях, м^3/кмоль")
  (defparameter *R-0*   8.314459848d0           "Универсальная газовая постоянная, Дж/моль*К")
  (defparameter *Na*    6.0221408211d23         "Число Авогадро, 1")
  (defparameter *No*    2.686781115d25          "Число Лошмидта, 1/м3")
  (defparameter *k*     1.3806485279d-23        "Постоянная Больцмана, Дж/К")
  (defparameter *a-e-m* 1.660540210d-27         "Атомная единица массы, кг")
  (defparameter *m-e*   9.109382616d-31         "Масса покоя электрона, кг")
  (defparameter *e*     -1.602176620898d-19     "Заряд электрона, Кл")
  (defparameter *F*     96485.3328959d4         "Число Фарадея, Кл/моль")
  (defparameter *h*     6.62607004081d-34       "Постоянная Планка, Дж*с")
  (defparameter *c*     299792458               "Скорость света в вакууме, м/с")
  (defparameter *μ-0*   (* 4 pi 1d-7)           "Магнитная постоянная, Гн/м")
  (defparameter *ε-0*   (/ 1 4 pi *c* *c* 1d-7) "Электрическая постоянная, Ф/м")
  )



