;;;; mnas-dim-value.lisp

(in-package #:mnas-dim-value)

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

"kgf/mm^2" "kgf/cm^2" "kgf/m^2" "mm_Hg" "mm_H2O"

(list
 (list "in"    (vd* 0.0254         |m|))
 (list "Å"     (vd* 1.0e-10        |m|))

 (list "t"     (vd* 1000           |kg|))
 (list "u"     (vd* 1.6605402e-27  |kg|))
 (list "lb"    (vd* 0.45359237     |kg|))

 (list "tf"    (vd* 1000 *g*       |kg|))
 (list "gf"    (vd* 1/1000 *g*     |kg|))
 (list "lbf"   (vd* 0.45359237 *g* |kg|))
  
 (list "cal"   (vd* 4.1868         |J|))
  
 (list "St"    (vd  1/10000 :m 2 :s -1))

 (list "m_Hg"  (vd* 133322.0       |Pa|))
 (list "m_H2O" (vd* 9806.65        |Pa|))
 (list "bar"   (vd* 100000         |Pa|))
 (list "atm"   (vd* 101325         |Pa|))
 (list "Torr"  (vd*
		(/ 101325.0 760)   |Pa|))
 (list "psi"   (vd/
		( vd* 0.45359237 *g* |kg|)
		( vd* 0.0254 |m|)
		( vd* 0.0254 |m|)))
  
 (list "b"     (vd* 1e-28      |m| |m|))

 (list "kn"  (vd/ |m| (vd/ 3600 1852.0 |s|)))
  
 (list "Gal"  (vd 1/100 :m 1 :s -2)))

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(defun K->C(K)
  "Перевод градусов значения, заданного в градусах Кельвина, в градусы Цельсия."
  (- K 273.15))

(defun C->K(C)
  "Перевод градусов значения, заданного в градусах Цельсия, в градусы Кельвина."
  (+ C 273.15))

(defun k->M (k)
"Перевод значения с приставкой кило в число с приставкой мега"
(* 0.001 k))

(defun M->k (M)
  "Перевод значения с приставкой мега в число с приставкой кило"
  (* 1000.0 M))

(defun kgs/cm2->Pa (kgs/cm2)
  "Переводит значение давления, заданное в kgs/cm2, в Pa."
  (* 9.8065 10000.0 kgs/cm2))

(defun Pa->kgs/cm2 (Pa)
  "Переводит значение давления, заданное в Pa, в kgs/cm2."
  (/ Pa 9.8065 10000.0))
