(defpackage :mnas-dim-value/tbl-ru
  (:use #:cl
        #:mnas-dim-value/class
        #:mnas-dim-value/mk-class
        #:mnas-dim-value/tbl
        )
  (:export *table-1*
           *table-2*
           *table-4*
           *table-5*
           *table-6*
           *table-7*
           *table-8*
           )
  (:export *table-9*)
  (:export *nd-tables*)
  )

(in-package :mnas-dim-value/tbl-ru)

(defparameter *table-2* nil)
(defparameter *table-4* nil)
(defparameter *table-5* nil)
(defparameter *table-6* nil)
(defparameter *table-8* nil)
(defparameter *table-9* nil)
(defparameter *nd-tables* nil)


(defparameter *table-7* 
  '((10  30 "кветта" "Кв")
    (10  27 "ронна"  "Рн" )
    (10  24 "йотта"  "И"  )
    (10  21 "зетта"  "З"  )
    (10  18 "экса"   "Э"  )
    (10  15 "пета"   "П"  )
    (10  12 "тера"   "Т"  )
    (10   9 "гига"   "Г"  )
    (10   6 "мега"   "М"  )
    (10   3 "кило"   "к"  )
    (10   2 "гекто"  "г"  )
    (10   1 "дека"   "да" )
    (10   0 ""       ""   )
    (10  -1 "деци"   "д"  )
    (10  -2 "санти"  "с"  )
    (10  -3 "милли"  "м"  )
    (10  -6 "микро"  "мк" )
    (10  -9 "нано"   "н"  )
    (10 -12 "пико"   "п"  )
    (10 -15 "фемто"  "ф"  )
    (10 -18 "атто"   "а"  )
    (10 -21 "зепто"  "з"  )
    (10 -24 "йокто"  "и"  )
    (10 -27 "ронто"  "рн" )
    (10 -30 "квекто" "кв" )
    )
  "*table-7* содержит множителные приставки;
Каждый подсписок содержит описание одной множительной приставки в
следующем формате:

1 - power - степень в которую необходимо возвести 10 для раскрытия приставки;
2 - nm-ru - наименование множителя русское;
3 - nm-en - наименование множителя международное;
4 - s-ru  - обозначение множителя русское;
5 - s-en  - обозначение множителя международное.")

(block table-2
  (nd-clear)
  (nd "безразмерный"                  "U"   "бр"      "бр"     (vd 1             )  nil)
  (nd "длина"	                      "L"   "метр"    "м"      (vd 1       :m   1) )
  (nd "масса"                         "M"   "грамм"   "г"      (vd 1/1000  :kg  1) )
  (nd "время"                         "T"   "секунда" "с"      (vd 1       :s   1) )
  (nd "сила тока электрического"      "I"   "ампер"   "А"      (vd 1       :A   1) )
  (nd "температура термодинамическая" "Θ"   "кельвин" "К"      (vd 1       :K   1) )
  (nd "количество вещества"           "N"   "моль"    "моль"   (vd 1       :mol 1) )
  (nd "сила света"                    "J"   "кандела" "кд"     (vd 1       :cd  1) )
  (setf *table-2* (nd-get))
  (setf (documentation  '*table-2* 'variable) 
        "Задает основные единицы измерения системы SI
(см. Таблица 1, ГОСТ 8.417-2002)"))

(block table-4
  (nd-clear)
  (nd "плоский угол" "L/L" "радиан" "рад" (vd 1 :rad 1) )                   ; "rad=m/m"
  (nd "телесный угол" "L^2/L^2" "стерадиан" "ср" (vd 1 :sr 1))                     ; "sr=m^2/m^2"
  (nd "частота" "1/T" "герц" "Гц" (vd 1 :s -1) )                    ; "Hz=s^-1"
  (nd "сила" nil "ньютон" "Н" (vd 1 :m 1 :kg 1 :s -2) )         ; "N=kg*m*s^-2"
  (nd "давление" nil "паскаль" "Па"     (vd 1 :m -1 :kg 1 :s -2) )        ; "Pa=kg*m^−1*s^−2=N/m^2"
  (nd "энергия, работа, количество теплоты" nil "джоуль" "Дж" (vd 1 :m 2 :kg 1 :s -2) )         ; "J=kg*m^2*s^-2=N*m"
  (nd "мощность, поток излучения" nil "ватт" "Вт" (vd 1 :m 2 :kg 1 :s -3) )         ; "W=kg*m^2*s^−3=J/s"
  (nd "электрический заряд, количество электричества" nil "кулон" "Кл"       (vd 1 :s 1 :A 1) )                ; "C=A*s"
  (nd "электрическое напряжение, электродвижущая сила" nil "вольт" "В"       (vd 1 :m 2 :kg 1 :s -3 :A -1) )   ; "V=kg*m^2*s^−3*A^−1=W/A"
  (nd "электрическая ёмкость" nil "фарад" "Ф" (vd 1 :m -2 :kg -1 :s 4 :A 2)  )  ; "F=kg−1 m−2 s4 A2=C/V"
  (nd "электрическое сопротивление" nil "ом" "Ом" (vd 1 :kg 1 :m 2  :s -3 :A -2) ) ; "Ω = kg m2 s−3 A−2=V/A"
  (nd "электрическая проводимость" nil "сименс" "См" (vd 1 :m -2 :kg -1 :s 3 :A 2) )   ; "S = kg−1 m−2 s3 A2=A/V"
  (nd "магнитный поток" nil "вебер" "Вб" (vd 1 :m 2 :kg 1 :s -2 :A -1) )   ; "Wb = kg m2 s−2 A−1=V s"
  (nd "магнитная индукция" nil "тесла" "Тл" (vd 1 :kg 1 :s -2 :A -1) )        ; "T = kg s−2 A−1 Wb/m2"
  (nd "индуктивность" nil "генри" "Гн" (vd 1 :m 2 :kg 1 :s -2 :A -2) )   ; "H = kg m2 s−2 A−2=Wb/A"
  (nd "температура по Цельсию" nil "градус Цельсия" "°С" (vd 1 :K 1) nil)                  ; "°С=K"
  (nd "световой поток" nil "люмен" "лм"       (vd 1 :cd 1 :sr 1) )              ; "lm = cd sr = cd sr"
  (nd "освещенность" nil  "люкс"  "лк"       (vd 1 :cd 1 :sr 1 :m -2) )        ; "lx = cd sr m−2=lm/m2"
  (nd "активность радионуклида" nil "беккерель" "Бк" (vd 1 :s -1) )                    ; "Bq = s−1"
  (nd "поглощенная доза излучения, керма" nil "грей" "Гр" (vd 1 :m 2 :s -2) )               ; "Gy = m2 s−2 J/kg"
  (nd "эквивалентная доза ионизирующего излучения" nil "зиверт" "Зв" (vd 1 :m 2 :s -2) )               ; "Sv = m2 s−2=J/kg"
  (nd "активность катализатора" nil "катал" "кат" (vd 1 :s -1 :mol 1) )             ; "kat = mol s−1"
  (setf *table-4* (nd-get))
  (setf (documentation  '*table-4* 'variable)
        "Задает производные единицы СИ, имеющие специальные наименование и
обозначения. (см. Таблица 3, ГОСТ 8.417-2002)"))

(block table-5 
  (nd-clear)
  (nd "площадь" nil "квадратный метр" "м^2" (vd 1 :m 2) )                     ; "m2"
  (nd "объём" nil  "кубический метр"  "м^3" (vd 1 :m 3)  )                    ; "m3"
  (nd "скорость" nil "метр в секунду" "м/с" (vd 1 :m 1 :s -1) )               ; "m s−1"
  (nd "ускорение"   nil "метр на секунду в квадрате"  "м/с^2" (vd 1 :m 1 :s -2) )               ; "m s−2"
  (nd "волновое число" nil "единица на метр" "1/м" (vd 1 :m -1) nil)                 ; "m−1"
  (nd "плотность" nil "килограмм на кубический метр" "кг/м^3" (vd 1 :kg 1 :m -3) )              ; "kg m−3"
  (nd "поверхностная плотность" nil "килограмм на квадратный метр" "кг/м^2" (vd 1 :kg 1 :m -2) )              ; "kg m−2"
  (nd "удельный объём" nil "кубический метр на килограмм" "м^3/кг" (vd 1 :m 3 :kg -1) )              ; "m3 kg−1"
  (nd "плотность электрического тока" nil "ампер на квадратный метр" "А/м^2" (vd 1 :A 1 :m -2) )               ; "A m−2"
  (nd "напряжённость магнитного поля" nil "ампер на метр" "А/м"              (vd 1 :A 1 :m -1) )               ; "A m−1"
  (nd "молярная концентрация компонента" nil "моль на кубический метр" "моль/м^3" (vd 1 :mol 1 :m -3) )             ; "mol m−3"
  (nd "массовая концентрация"  nil "килограмм на кубический метр" "кг/м^3" (vd 1 :kg -1 :m 3) )              ; "kg m−3"
  (nd "яркость" nil "кандела на квадратный метр" "кд/м^2"       (vd 1 :cd 1 :m -2) )  ; "cd m−2"
;;;; Дополнительные примеры величин начало
  (nd "импульс, количество движения" nil "килограмм-метр на секунду" "кг*м/с"       (vd 1 :kg 1 :m 1 :s -1))
  (nd "кинематическая вязкость" nil "квадратный метр на секунду" "м^2/с"       (vd 1 :m 2 :s -1))
  (nd "момент инерции" nil "килограмм-квадратный метр" "кг*м^2"          (vd 1 :kg 1 :m 2))
  (nd "массовый расход" nil "килограмм в секунду" "кг/с"       (vd 1 :kg 1 :s -1))
  (nd "объёмный расход" nil "кубический метр в секунду" "м^3/с" (vd 1 :m 3 :s -1))
  (nd "молекулярный расход" nil "моль в секунду"  "моль/с"       (vd 1 :mol 1 :s -1))
  (nd "молекулярный вес" nil "килограмм на моль" "кг/моль"       (vd 1 :kg 1 :mol -1))
;;;; Дополнительные примеры величин конец
  (setf *table-5* (nd-get))
  (setf (documentation '*table-5* 'variable)
        "Производные единицы СИ, наименования и обозначения которых образованы
с использованием наименований и обозначений основных единиц
СИ (см. Таблица 2, ГОСТ 8.417-2002)"))

(block table-6
  (nd-clear)
  (nd "динамическая вязкость" nil "паскаль-секунда" "Па*с" (vd 1 :kg 1 :m -1 :s -1) )        ; "Pa s=kg m-1 s-1"
  (nd "момент силы" nil "ньютон-метр" "Н*м"                (vd 1  :kg 1 :m 2 :s -2) )        ; "N m=kg m2 s-2"
  (nd "поверхностное натяжение" nil "ньютон на метр" "Н/м" (vd 1 :kg 1 :s -2) )              ; "N m-1=kg s-2"
  (nd "угловая скорость" nil "радиан в секунду" "рад/с"    (vd 1 :rad 1 :s -1) )             ; "rad s−1=s−1"
  (nd "угловое ускорение" nil "радиан на секунду в квадрате" "рад/с^2" (vd 1 :rad 1 :s -2) )             ; "rad s−2=s−2"
  (nd "поверхностная плотность потока энергии"  nil "ватт на квадратный метр"  "Вт/м^2" (vd 1 :kg 1 :s -3) )              ; "W m−2=kg s−3"
  (nd "теплоемкость системы, энтропия системы" nil "джоуль на кельвин" "Дж/К" (vd 1 :kg 1 :m 2 :s -2 :K -1) )   ; "J K−1=kg m2 s−2 K−1"
  (nd "удельная теплоёмкость, удельная энтропия" nil "джоуль на килограмм-кельвин" "Дж/(кг*К)" (vd 1 :m 2 :s -2 :K -1) )         ; "J K−1 kg−1=m2 s−2 K−1"
  (nd "удельная энергия" nil "джоуль на килограмм"  "Дж/кг" (vd 1 :m 2 :s -2))                ; "J kg−1=m2 s−2"
  (nd "теплопроводность" nil "ватт на метр-кельвин"  "Вт/(м*К)" (vd 1 :kg 1 :m 1 :s -3 :K -1 ))   ; "W m−1 K−1=kg m s−3 K−1"
  (nd "плотноть энергии" nil  "джоуль на кубический метр" "Дж/м^3" (vd 1  :kg 1 :m -1 :s -2))        ; "J m−3=kg m−1 s−2"
  (nd "напряженность электрического поля" nil "воль на метр" "В/м" (vd 1 :kg 1 :m 1 :s -3 :A -1))    ; "V m−1=kg m s−3 A−1"
  (nd "пространственная плотность электрического заряда" nil "кулон на кубический метр" "Кл/м^3" (vd 1 :A 1 :s 1 :m -3))           ; "C m−3=A s m−3"
  (nd "поверхностная плотность заряда" nil "кулон на квадратный метр"  "Кл/м^2" (vd 1 :A 1 :s 1 :m -2))           ; "C m−2=A s m−2"
  (nd "плотность электрического потока, электрическое смещение" nil "кулон на квадратный метр" "Кл/м^2" (vd 1 :A 1 :s 1 :m -2))           ; "C m−2=A s m−2"
  (nd "диэлектрическая проницаемость" nil "фарад на метр" "Ф/м" (vd 1 :kg -1 :m -3 :s 4 :A 2))    ; "F m−1=kg−1 m−3 s4 A2"
  (nd "магнитная проницаемость" nil "генри на метр" "Гн/м"      (vd 1 :kg 1 :m 1 :s -2 :A -2))    ; "H m−1=kg m s−2 A−2"
  (nd "молярная внутренняя энергия" nil "джоуль на моль" "Дж/моль" (vd 1 :kg 1 :m 2 :s -2 :mol -1))  ;  "J mol−1=kg m2 s−2 mol−1"
  (nd "молярная энтропия, молярная теплоёмкость" nil "джоуль на моль-кельвин" "Дж/(моль*К)" (vd 1 :kg 1 :m 2 :s -2 :mol -1 :K -1)) ; "J K−1 mol−1=kg m2 s−2 mol−1 K−1"
  (nd "экспозиционная доза фотонного излучения" nil "кулон на килограмм" "Кл/кг" (vd 1 :A 1 :s 1 :kg -1))          ; "C kg−1=A s kg−1"
  (nd "мощность поглощённой дозы" nil "грей в секунду" "Гр/с"      (vd 1 :m 2 :s -3))                ; "Gy s−1=m2 s−3"
  (nd "сила излучения" nil "ватт на стерадиан" "Вт/ср"       (vd 1 :kg 1 :m 2 :s -3 :sr -1))   ;  "W sr−1=kg m2 s−3"
  (nd "энергетическая яркость" nil "ватт на стерадан-кадратный метр" "Вт/(ср*м^2)" (vd 1 :kg 1 :s -3 :sr -1))        ; "W sr−1 m−2=kg s−3"
  (nd "концентрация каталитической активности" nil "катал на кубический метр" "кат/м^3" (vd 1 :mol 1 :s -1 :m -3))  ; "kat m−3=mol s−1 m−3"
;;;; Дополнительные примеры начало  
  (nd "импульс силы" nil "ньютон-секунда" "Н*с"      (vd 1 :kg 1 :m 1 :s -1))         ; "N s=kg*m*s^-1"
;;;; Дополнительные примеры конец
  (setf *table-6* (nd-get))
  (setf (documentation  '*table-6* 'variable)
        "Производные единицы СИ, наименования и обозначения которых образованы
с использованием специальных наименований и обозначений. (см. Таблица
4, ГОСТ 8.417-2002)"))

(block table-8
  (nd-clear)
  (nd "время" nil "минута" "мин" (vd 60 :s 1) nil)
  (nd "время" nil "час" "ч"      (vd 3600 :s 1) nil)
  (nd "время" nil "сутки"  "сут"      (vd 86400 :s 1) nil)
;;;;
  (nd "длина" nil "астрономическая единица" "а.е." (vd 149597870700d0 :m 1) nil)
;;;;
  (nd "плоский угол" nil "градус" "°" (vd (/ pi 180) :rad 1) nil)
   (nd "плоский угол" nil "минута" "'" (vd (/ pi 180 60) :rad 1) nil)
   (nd "плоский угол" nil "секунда" "\"" (vd (/ pi 180 60 60) :rad 1) nil)
;;;;
   (nd "площадь" nil "гектар" "га" (vd (* 100 100) :m 2)   nil)
;;;;
   (nd "объём" nil "литр" "л"           (vd 1/1000 :m 3) '((-3 -3) (0 3)))
;;;;
   (nd "масса" nil "тонна" "т"
       (vd 1000 :kg 1) '((0 24)))
   (nd "масса" nil "атомная единица массы" "а.е.м." (vd 1.6605390666050d-27 :kg 1))
;;;;
   (nd "энергия" nil "электрон-вольт" "эВ"       (vd 1.602176634d-19 :m 2 :kg 1 :s -2) nil)
;;;; logarithmic neper (h) Np see text
;;;; ratio quantities bel (h) B
;;;; decibel (h) dB
;;;; Дополнительные величины начало
   (nd "плоский угол" nil "град" "град" (vd  (/ pi 200) :rad 1) nil)
   (nd "длина" nil   "световой год" "св.год" (vd 9.460730472580800d15 :m 1) nil)
   (nd "длина" nil "парсек" "пк" (vd 3.0856776d16  :m 1) nil)
   (nd "оптическая сила" nil "диоптрия" "дптр" (vd 1 :m -1)  nil)
   (nd "площадь" nil "ар" "а" (vd 100 :m 2)   nil)
   (nd "энергия" nil "киловатт-час" "кВт*ч" (vd (* 36/10 1000 1000) :m 2 :kg 1 :s -2) nil) 
   (nd "полная мощность" nil "вольт-ампер" "В*А" (vd 1 :m 2 :kg 1 :s -3) nil)
   (nd "рекативная мощность" nil "вар" "вар" (vd 1 :m 2 :kg 1 :s -3) nil)
   (nd "электрический заряд" nil "ампер-час" "А*ч" (vd (* 36/10 1000) :s 1 :A 1) nil)
;;;; Дополнительные величины конец
     (setf *table-8* (nd-get))
     (setf (documentation  '*table-8* 'variable)
           "Внесистемные единицы, допустимые к применению наравне с единицами СИ"))

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(block table-9
  (nd-clear)
;;; "mass" "масса"  
  (nd "масса" nil "центнер" "ц" (vd 100 :kg 1) nil)
  (nd "масса" nil "карат" "кар" (vd 2/10000 :kg 1) nil)
;;; "angle of rotation" "угол поворота"
  (nd "угол поворота" nil "оборот" "об" (vd (* 2 pi) :rad 1) nil)  
;;; "length" "длина"  
  (nd "длина" nil "морская миля" "миля" (vd 1852 :m 1)   nil)
  (nd "длина" nil "ангстрем" "Å"  (vd 1d-10 :m 1) nil)
  (nd "длина" nil "микрон" "мк"   (vd (/ 1 1000 1000) :m 1) nil)
;;;  "solid angle" "телесный угол"
  (nd "телесный угол"  nil "квадратный градус" "□°" (vd (expt (/ pi 180) 2) :sr 1) nil)
  (nd "телесный угол"  nil "квадратная минута" "□′" (vd (expt (/ pi 180 60) 2) :sr 1) nil)
  (nd "телесный угол"  nil "квадратная секунда" "□″" (vd (expt (/ pi 180 60 60) 2) :sr 1) nil)  
  (nd "телесный угол"  nil "спат" "сп" (vd (* 4 pi) :sr 1) nil)  
;;; "force" "сила"
  (nd "сила" nil "грамм-сила"  "гс"      (vd (* 1/1000 9.80665d0) :m 1 :s -2 :kg 1) '((-24 3)))
  (nd "сила" nil "тонна-сила"  "тс"      (vd (* 1000 9.80665d0) :m 1 :s -2 :kg 1) '((0 24)))
  (nd "сила" nil "понд" "п"              (vd (* 1/1000 9.80665d0) :m 1 :s -2 :kg 1) '((0 0) (3 9)))
;;; "pressure" "давление"
  (nd "давление" nil "метр водяного столба" "м_вод._ст."      (vd (* 1000 9.80665d0) :m -1 :kg 1 :s -2) '((-3 0)))
  (nd "давление" nil "метр ртутного столба" "м_pт._ст."       (vd  133322d0 :m -1 :kg 1 :s -2) '((-3 0)))
  (nd "давление" nil "торр" "Торр" (vd 133.322d0 :m -1 :kg 1 :s -2) '((-6 9)))
  (nd "давление" nil "бар" "бар"       (vd (* 100 000) :m -1 :kg 1 :s -2) '((-3 -3) (3 9)))
;;; "power" "мощность" 
  (nd "мощность" nil "лошадиная сила" "л.с."       (vd (* 75 9.80665d0) :kg 1 :m 2 :s -3 ) nil)
;;; "rotational speed" "частота вращения"
  (nd "частота вращения" nil "оборот в секунду" "об/с"       (vd (* pi 2)  :rad 1  :s -1)   nil)
  (nd "частота вращения" nil "оборот в минуту"  "об/мин"     (vd (* pi 2 1/60) :rad 1 :s -1)   nil)
;;; "quantity of heat" "количество теплоты"
  (nd "количество теплоты" nil "калория" "кал" (vd 4.1868 :kg 1 :m 2  :s -2) '((-30 30)))
  (nd "количество теплоты" nil "калория термохимическая" "кал_{тх}" (vd 4.1840 :kg 1 :m 2  :s -2) '((-30 30)))
  (nd "теплота химической рекции" nil "калория  15-градусная" "кал_{15}" (vd 4.1855 :kg 1 :m 2  :s -2) '((-30 30)))    
;;;
  (setf *table-9* (nd-get))
  (setf (documentation  '*table-9* 'variable)
        "Соотношение некоторых внесистемных единиц с единицами СИ"))

(defparameter *nd-tables*
  (append 
   *table-2*
   *table-4*
   *table-5*
   *table-6*
   *table-8*
   *table-9*))

(nd-check-table *nd-tables*)
